<?php
/*
 * 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
 * а в качестве значений – массивы с названиями городов из соответствующей области.
 *
 * Вывести в цикле значения массива, чтобы результат был таким:
 * Московская область:
 * Москва, Зеленоград, Клин
 * Ленинградская область:
 * Санкт-Петербург, Всеволожск, Павловск, Кронштадт
 * Рязанская область … (названия городов можно найти на maps.yandex.ru)
 *
 */
header('Content-Type: text/html; charset=utf-8');
error_reporting(-1);
$arr = array (
                "Московская область" => array ("Mосква", "Балашиха", "Клин", "Бронницы", "Дзержинский", "Дмитров", "Долгопрудный", "Домодедово", "Егорьевск", "Звенигород", "Истра"),
                "Ленинградская область" => array ("Санкт-Петербург", "Бокситогорск", "Волосово", "Всеволожск", "Выборг", "Каменногорск", "Кировск"),
                "Рязанская область" => array ("Кадом", "Касимов", "Кораблино", "Лесной", "Милославское", "Михайлов", "Милославское", "Михайлов")
);
 
foreach ($arr as $area => $city)
{
        echo(
                "<h2>$area :</h2>"
               
        );
        foreach ($city as $key => $city)
        {
                echo("$city</br>");
        }
       
}